pmo-dataset/variations/graphviz_with_ids/47.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "User_1" [label="select course"];
  "User_2" [label="select specific\ncourse"];
  "User_3" [label="check if registered\nat eligible\nuniversity"];
  "User_4" [label="log into account"];
  "User_5" [label="register account"];
  "User_6" [label="request activation"];
  "User_7" [label="connect to twitter\naccount"];
  "User_8" [label="invite friends to\ncourse"];
  "User_9" [label="provide payment info"];
  "User_10" [label="check if another\ncourse is\ninteresting"];
  "Service_1" [label="system shows\nparallel courses and\ndates"];
  "Service_2" [label="system checks\neligibility"];
  "Service_3" [label="system issues course\ntickets"];
  "StartNoneEvent_1" [shape=circle, label="wish to enroll in\ncourse"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="end process"];
  "ExclusiveGateway_1" [shape=diamond, label="free spots?"];
  "ExclusiveGateway_2" [shape=diamond, label="already registered?"];
  "ExclusiveGateway_3" [shape=diamond, label="eligible university?"];
  "ExclusiveGateway_4" [shape=diamond, label="person eligible?"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ExclusiveGateway_6" [shape=diamond, label="X"];
  "ExclusiveGateway_7" [shape=diamond, label="X"];
  "ExclusiveGateway_8" [shape=diamond, label="X"];
  "ExclusiveGateway_9" [shape=diamond, label="X"];
  "ExclusiveGateway_10" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "User_1" -> "ExclusiveGateway_1";
  "Service_1" -> "User_2";
  "User_3" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "User_6" [label="no"];
  "User_6" -> "Service_2";
  "Service_2" -> "ExclusiveGateway_4";
  "User_7" -> "User_8";
  "ExclusiveGateway_1" -> "Service_1" [label="yes"];
  "ExclusiveGateway_2" -> "User_3" [label="no"];
  "User_4" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "User_7";
  "User_10" -> "ExclusiveGateway_5";
  "ParallelGateway_2" -> "Service_3";
  "User_8" -> "ParallelGateway_2";
  "User_9" -> "ParallelGateway_2";
  "ExclusiveGateway_1" -> "User_10" [label="no"];
  "User_2" -> "ExclusiveGateway_2";
  "StartNoneEvent_1" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "User_1";
  "ExclusiveGateway_5" -> "ExclusiveGateway_6" [label="yes"];
  "Service_3" -> "ExclusiveGateway_7";
  "ExclusiveGateway_7" -> "ExclusiveGateway_8";
  "ExclusiveGateway_8" -> "EndNoneEvent_1";
  "ExclusiveGateway_5" -> "ExclusiveGateway_7" [label="no"];
  "ExclusiveGateway_4" -> "ExclusiveGateway_8" [label="no"];
  "ParallelGateway_1" -> "User_9";
  "ExclusiveGateway_9" -> "User_5";
  "ExclusiveGateway_2" -> "ExclusiveGateway_10" [label="yes"];
  "ExclusiveGateway_10" -> "User_4";
  "User_5" -> "ExclusiveGateway_10";
  "ExclusiveGateway_4" -> "ExclusiveGateway_9" [label="yes"];
  "ExclusiveGateway_3" -> "ExclusiveGateway_9" [label="yes"];
}
