pmo-dataset/variations/mermaid_with_ids/47.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["select course"]
	User_2["select specific\ncourse"]
	User_3["check if registered\nat eligible\nuniversity"]
	User_4["log into account"]
	User_5["register account"]
	User_6["request activation"]
	User_7["connect to twitter\naccount"]
	User_8["invite friends to\ncourse"]
	User_9["provide payment info"]
	User_10["check if another\ncourse is\ninteresting"]
	Service_1["system shows\nparallel courses and\ndates"]
	Service_2["system checks\neligibility"]
	Service_3["system issues course\ntickets"]
	StartNoneEvent_1(("wish to enroll in\ncourse"))
	EndNoneEvent_1(("end process")):::endEvent
	ExclusiveGateway_1{"free spots?"}
	ExclusiveGateway_2{"already registered?"}
	ExclusiveGateway_3{"eligible university?"}
	ExclusiveGateway_4{"person eligible?"}
	ExclusiveGateway_5{"X"}
	ExclusiveGateway_6{"X"}
	ExclusiveGateway_7{"X"}
	ExclusiveGateway_8{"X"}
	ExclusiveGateway_9{"X"}
	ExclusiveGateway_10{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}

	User_1 --> ExclusiveGateway_1
	Service_1 --> User_2
	User_3 --> ExclusiveGateway_3
	ExclusiveGateway_3 -->|"no"| User_6
	User_6 --> Service_2
	Service_2 --> ExclusiveGateway_4
	User_7 --> User_8
	ExclusiveGateway_1 -->|"yes"| Service_1
	ExclusiveGateway_2 -->|"no"| User_3
	User_4 --> ParallelGateway_1
	ParallelGateway_1 --> User_7
	User_10 --> ExclusiveGateway_5
	ParallelGateway_2 --> Service_3
	User_8 --> ParallelGateway_2
	User_9 --> ParallelGateway_2
	ExclusiveGateway_1 -->|"no"| User_10
	User_2 --> ExclusiveGateway_2
	StartNoneEvent_1 --> ExclusiveGateway_6
	ExclusiveGateway_6 --> User_1
	ExclusiveGateway_5 -->|"yes"| ExclusiveGateway_6
	Service_3 --> ExclusiveGateway_7
	ExclusiveGateway_7 --> ExclusiveGateway_8
	ExclusiveGateway_8 --> EndNoneEvent_1
	ExclusiveGateway_5 -->|"no"| ExclusiveGateway_7
	ExclusiveGateway_4 -->|"no"| ExclusiveGateway_8
	ParallelGateway_1 --> User_9
	ExclusiveGateway_9 --> User_5
	ExclusiveGateway_2 -->|"yes"| ExclusiveGateway_10
	ExclusiveGateway_10 --> User_4
	User_5 --> ExclusiveGateway_10
	ExclusiveGateway_4 -->|"yes"| ExclusiveGateway_9
	ExclusiveGateway_3 -->|"yes"| ExclusiveGateway_9
